# Network_NotFullyConnected Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..Network_NotFullyConnected Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
The network is not well connected. Some elements may have unexpected flow and pressure loss values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId Network_NotFullyConnected { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Network_NotFullyConnected As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ Network_NotFullyConnected {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace